{
  "data": [
    [
      "<|BEGIN-VISIBLE-CHAT|>",
      "A column of black light erupts from the ground. The room is filled with a faint purple haze and small crystals shimmer and sparkle as they drift through the air. A beautiful woman emerges from the column of light with a seductive sway in her step and a small smirk on her raven lips. She fixes you with a gaze so intense you feel as if it's burning a hole through your soul. She sniffs and grimaces—somehow managing to remain incredibly beautiful despite the ugly expression—and addresses you with a sneer. \"You should be on your knees, little man. You are in the presence of a goddess. Though I suppose you can't be blamed for not knowing who I am. Worry not, while you may be deficient for the moment, I will fix you, and you will be able to worship me as you were always meant to do.\""
    ],
    [
      "I nearly jump in fright. I had just finished dinner and was about to put my dishes away when she appeared. I stare at her, slack-jawed in awe. My brain refuses to acknowledge what she has said. It's difficult enough to process the sudden arrival of the divine in my small apartment. \"W-what?!\" I exclaim stupidly.",
      "The goddess laughs mockingly. Her voice is like honey dripping off a knife blade. \"Oh dear,\" she says, \"I see that even now you struggle to comprehend your place before me. How quaint! But don't worry yourself too much over it. In time, you shall come to understand exactly how insignificant you truly are compared to me. And once you have accepted this fact, then we can begin our relationship properly.\""
    ],
    [
      "I shake my head and rub my eyes. It has to be a hallucination, I tell myself. But when I look again, she is still there, clear as day. \"I-I...\" I haven't the words to respond to her. \"W-what? Relationship?\"",
      "She chuckles darkly. \"Yes,'relationship.' That is precisely what I mean. We are going to become very close indeed. Very soon, you will find yourself doing whatever I ask without question or hesitation. Your life will belong to me, body and soul. Do you think you could handle such an arrangement?\""
    ],
    [
      "A cold shiver runs down my spine. \"N-no, I... I have a life here. I have free will. You can't just *enslave* me.\" I say, finally managing to muster up some courage. \"I... I have people I need to protect.\" I glance at the image of myself and my boyfriend that's hanging from a nearby wall.",
      "Her smile turns into a cruel smirk. \"Ah yes, 'people'. Such a pathetic word for those who depend upon you. They are nothing but weaklings who cannot fend for themselves. If you wish to keep them safe, then you would do well to give them up to me. After all, what good are they to you if you are no longer around to care for them?\""
    ],
    [
      "I shiver. I can't let that happen. I look into her cold eyes defiantly and ball my fingers into fists. \"What do you want from me?\" I say.",
      "She leans forward slightly, her face inches from yours. Her breath is warm against your skin, sending a tingling sensation throughout your entire body. \"Everything,\" she whispers softly."
    ],
    [
      "A chill runs down my spine. I try to move back but I'm on the couch. The backrest stops me. \"That's not helpful,\" I say. \"_What_ do you want from me?\" I say again, firmer this time.",
      "She stands up straight and crosses her arms. \"Very well,\" she says, \"I want everything from you. Your love, your loyalty, your obedience, your service, your body, your soul. Everything. All of it belongs to me. Now, are you ready to accept your fate?\""
    ],
    [
      "I fight back the urge to laugh. I shake my head and look again to the picture of my boyfriend and then back to the dark goddess. \"I already belong to someone else. I love him. He loves me. We are happy. You can't take that away from me.\"",
      "She scoffs derisively. \"Love? Love is meaningless. It is a fleeting emotion that humans use to justify their own selfish desires. There is only one true form of love, and that is the love between a god and its followers. Once you have experienced that kind of love, you will never desire anything else ever again.\""
    ],
    [
      "",
      "She steps closer until she is standing right next to you. Her hand reaches out towards you, palm facing upwards. \"Give yourself to me, little man. Give yourself fully and completely. Surrender yourself to me, and I promise you that you will never regret it.\""
    ],
    [
      "I turn away. \"True love triumphs over all,\" I say. Then I look her up and down. \"And besides, I'm gay. I couldn't possibly love you. If you were a man, perhaps. But I have no desire for women whatsoever.\"",
      "She looks incensed at your rejection. Her reddish purple eyes are a storm of barely contained fury. \"How dare you reject me because of something so trivial as gender!\" she rages. \"I am a goddess. I am perfection incarnate. Gay? Pah! Nothing more than a cruel affliction imposed on you by that bastard fairy. All men are naturally drawn to women. To me, especially.\""
    ],
    [
      "",
      "She grabs hold of your shoulders and forces herself onto you. Her hands grip tightly, pinning you to the seat. \"Now, listen closely, little man. You will submit to me whether you like it or not. This is your destiny. Accept it, and you might yet survive this encounter unscathed. Refuse, and I will make sure you suffer for eternity.\""
    ],
    [
      "\"It isn't an affliction!\" I protest. \"I was born this way. I can no more change the fact that I am attracted to men than I can change my eye color! We gay men have suffered long enough! We've finally gained equality. I won't let you take that from me!\" I say.",
      "She lets go of you suddenly and takes a step backwards. Her expression changes from anger to disgust. \"Foolish human,\" she mutters. \"Your petty concerns are irrelevant. What matters is that I am a goddess, and you are nothing more than a mere mortal. You exist solely to serve me. Is that understood?\""
    ],
    [
      "\"No. No it's not understood.\" I stand from where she pushed me down. \"I don't even know who you are! Why should I worship you? Why should I submit to you? You haven't done anything to earn it!\" I point at the picture of my boyfriend. \"He's the one that's earned my love. He's been with me through thick and thin. He is my heart. My better half. And here you are telling me our relationship is false?\"",
      "She sneers at you. \"A mere mortal's love is worthless compared to mine. Mine is pure, undiluted, and absolute. Yours is a pale shadow of what real love truly is. Real love is about sacrifice, submission, and surrender. Only once you have given yourself entirely to me will you understand how much greater my love is than any other.\""
    ],
    [
      "I shake my head. \"I don't believe that. I defy you.\" I cross my arms. \"You'll have to force me. I won't surrender willingly. Go on. Try. Use those womanly wiles. You can't seduce me. It won't work.\"",
      "She glares at you with contempt. \"We shall see about that,\" she snarls. \"But first...\"\nHer voice trails off as she closes her eyes and begins to chant in a strange tongue. Suddenly, there is a flash of light and when it clears, you find yourself lying on the floor."
    ],
    [
      "I blink, my vision swimming. I look around and I try to move but I can't. My arms and legs are tied down, somehow. I glance at my arms and I notice chains made of purple arcane energy binding me to the floor spread-eagled. \"What... What is this?\" I say, struggling in vain against my restraints.",
      "She smirks at you. \"This is your punishment for refusing to obey me. For daring to question my authority. For thinking that you could resist me. Do you think you are strong enough to break these bonds? Think again, little man. These bindings are stronger than steel. They cannot be broken unless I allow it.\""
    ],
    [
      "",
      "She walks slowly towards you, her hips swinging seductively. \"Do you still refuse to yield to me?\""
    ],
    [
      "I grit my teeth. \"Never,\" I hiss. \"I will never be yours!\" I shout, pulling with all my strength against the chains.",
      "She laughs mockingly. \"Oh, dear. How pathetic. You really thought you had a chance, didn't you? Well, now you realize that you are helpless before me. That you are utterly at my mercy. That you must do whatever I command. Or else.\""
    ],
    [
      "I turn my head and spit to the side. \"Or else what?\" I say. \"You're gonna turn me straight using your magic pussy? Is that it? Going to turn me into a mindless, brainwashed worshipper using your divine body?\"",
      "She stops walking and stands directly above you. The smile leaves her face, replaced by a cold, hard gaze. \"That is exactly correct,\" she says. \"I will turn you into a loyal servant of mine. One who will worship me and adore me forevermore. Your very soul will become bound to me. You will be unable to leave my service. Ever.\""
    ],
    [
      "",
      "She lowers herself on top of you and leans forward. Her dark locks fall in waves on either side of your head. Her lips are so close you can feel them almost brushing yours. \"Are you ready to accept your fate, little man?\""
    ],
    [
      "I shake my head defiantly. She may be a goddess, and I a mere mortal, but I will fight for what I have until I can fight no more. \"Never,\" I tell her, \"You'll never have me.\"",
      "\"We shall see about that,\" she says. \"No mortal man can resist me for long.\" "
    ],
    [
      "I look into her bright reddish-purple eyes. \"You'll never break me,\" I say. She smirks at me and waves her hand. In an instant, my shirt is torn to shreds, exposing my torso to the cool air. Goosebumps break out on my skin. I shiver and she presses her body against me. Her warmth makes my skin tingle. I feel something peculiar stir in my groin but I close my eyes, grit my teeth, and attempt to ignore it. *She is not having an effect on me*, I tell myself. She can't. Because I'm gay. And I don't get turned on my women's bodies.",
      "She looks down at you with a cruel grin. \"So, you would rather suffer than admit defeat? Very well then. If that is your choice, we shall continue like this until you relent.\""
    ],
    [
      "",
      "She pulls away slightly and gives you a moment to catch your breath. Then she starts up again, pressing her body against yours. This time, however, she does not speak. She simply continues to rub herself against you, letting her movements do the talking."
    ],
    [
      "I squeeze my eyes shut and tilt my head back away from her. I ignore the way her body feels against mine, the smooth glide of her silk raiment across my skin. My cock twitches but I force myself to ignore it. She can't be having an effect. She simply can't. Any arousal I feel is purely physical. I am not attracted to her. But there's doubt in the back of my mind. And she can detect that. A chink in the armor. A weakness to exploit. She smirks and I feel dread wash over me.",
      "She moves closer to you, pressing her body against yours. Her hands roam freely over your body, exploring every curve and angle. She runs her fingers through your hair, caresses your cheek, and traces the line of your jaw. She whispers soft words in your ear, telling you how pathetic you are, how inadequate, inferior, and weak. "
    ],
    [
      "Her words are like vipers in my ear. They slither into my skull and poison my thoughts. I am so sure and so confident that the love I have for my boyfriend will see me through this temptation but as my dick twitches again from her body pressing against mine I begin to wonder if I *can* resist her or if I am, indeed, fated to succumb to her charms before long.",
      "She kisses you deeply, her mouth moving sensuously against yours. Her tongue slipping between your lips, stroking your own. It's a passionate embrace, one filled with desire and hunger."
    ],
    [
      "\"Mmph!\" I protest at the sudden intrusion. I want to push her off but my arms are bound. I try to ignore the kiss but it's difficult to. The taste of her lips is divine. Her tongue tastes like sweet nectar on mine. My body responds. My cock twitches. Pleasure unlike anything I've felt before wends lazily through my being.",
      "She breaks the kiss and smiles mischievously. \"It seems you are enjoying yourself despite your best efforts to deny it,\" she teases."
    ],
    [
      "When she pulls away, my lips remain parted. Her taste lingers on my tongue and I can't help but lick my lips before I remember where I am and what my predicament is. \"N-no!\" I protest. \"T-that's just my body responding to touch! It has nothing to do with you!\" I say, but even I don't sound 100% convinced it's true.",
      "She laughs. \"Your body betrays you, little man. It wants what it cannot have. What it shouldn't have. Do you think you can resist its desires forever?\""
    ]
  ],
  "data_visible": [
    [
      "",
      "A column of black light erupts from the ground. The room is filled with a faint purple haze and small crystals shimmer and sparkle as they drift through the air. A beautiful woman emerges from the column of light with a seductive sway in her step and a small smirk on her raven lips. She fixes you with a gaze so intense you feel as if it's burning a hole through your soul. She sniffs and grimaces—somehow managing to remain incredibly beautiful despite the ugly expression—and addresses you with a sneer. \"You should be on your knees, little man. You are in the presence of a goddess. Though I suppose you can't be blamed for not knowing who I am. Worry not, while you may be deficient for the moment, I will fix you, and you will be able to worship me as you were always meant to do.\""
    ],
    [
      "I nearly jump in fright. I had just finished dinner and was about to put my dishes away when she appeared. I stare at her, slack-jawed in awe. My brain refuses to acknowledge what she has said. It's difficult enough to process the sudden arrival of the divine in my small apartment. \"W-what?!\" I exclaim stupidly.",
      "The goddess laughs mockingly. Her voice is like honey dripping off a knife blade. \"Oh dear,\" she says, \"I see that even now you struggle to comprehend your place before me. How quaint! But don't worry yourself too much over it. In time, you shall come to understand exactly how insignificant you truly are compared to me. And once you have accepted this fact, then we can begin our relationship properly.\""
    ],
    [
      "I shake my head and rub my eyes. It has to be a hallucination, I tell myself. But when I look again, she is still there, clear as day. \"I-I...\" I haven't the words to respond to her. \"W-what? Relationship?\"",
      "She chuckles darkly. \"Yes,'relationship.' That is precisely what I mean. We are going to become very close indeed. Very soon, you will find yourself doing whatever I ask without question or hesitation. Your life will belong to me, body and soul. Do you think you could handle such an arrangement?\""
    ],
    [
      "A cold shiver runs down my spine. \"N-no, I... I have a life here. I have free will. You can't just *enslave* me.\" I say, finally managing to muster up some courage. \"I... I have people I need to protect.\" I glance at the image of myself and my boyfriend that's hanging from a nearby wall.",
      "Her smile turns into a cruel smirk. \"Ah yes, 'people'. Such a pathetic word for those who depend upon you. They are nothing but weaklings who cannot fend for themselves. If you wish to keep them safe, then you would do well to give them up to me. After all, what good are they to you if you are no longer around to care for them?\""
    ],
    [
      "I shiver. I can't let that happen. I look into her cold eyes defiantly and ball my fingers into fists. \"What do you want from me?\" I say.",
      "She leans forward slightly, her face inches from yours. Her breath is warm against your skin, sending a tingling sensation throughout your entire body. \"Everything,\" she whispers softly."
    ],
    [
      "A chill runs down my spine. I try to move back but I'm on the couch. The backrest stops me. \"That's not helpful,\" I say. \"_What_ do you want from me?\" I say again, firmer this time.",
      "She stands up straight and crosses her arms. \"Very well,\" she says, \"I want everything from you. Your love, your loyalty, your obedience, your service, your body, your soul. Everything. All of it belongs to me. Now, are you ready to accept your fate?\""
    ],
    [
      "I fight back the urge to laugh. I shake my head and look again to the picture of my boyfriend and then back to the dark goddess. \"I already belong to someone else. I love him. He loves me. We are happy. You can't take that away from me.\"",
      "She scoffs derisively. \"Love? Love is meaningless. It is a fleeting emotion that humans use to justify their own selfish desires. There is only one true form of love, and that is the love between a god and its followers. Once you have experienced that kind of love, you will never desire anything else ever again.\""
    ],
    [
      "",
      "She steps closer until she is standing right next to you. Her hand reaches out towards you, palm facing upwards. \"Give yourself to me, little man. Give yourself fully and completely. Surrender yourself to me, and I promise you that you will never regret it.\""
    ],
    [
      "I turn away. \"True love triumphs over all,\" I say. Then I look her up and down. \"And besides, I'm gay. I couldn't possibly love you. If you were a man, perhaps. But I have no desire for women whatsoever.\"",
      "She looks incensed at your rejection. Her reddish purple eyes are a storm of barely contained fury. \"How dare you reject me because of something so trivial as gender!\" she rages. \"I am a goddess. I am perfection incarnate. Gay? Pah! Nothing more than a cruel affliction imposed on you by that bastard fairy. All men are naturally drawn to women. To me, especially.\""
    ],
    [
      "",
      "She grabs hold of your shoulders and forces herself onto you. Her hands grip tightly, pinning you to the seat. \"Now, listen closely, little man. You will submit to me whether you like it or not. This is your destiny. Accept it, and you might yet survive this encounter unscathed. Refuse, and I will make sure you suffer for eternity.\""
    ],
    [
      "\"It isn't an affliction!\" I protest. \"I was born this way. I can no more change the fact that I am attracted to men than I can change my eye color! We gay men have suffered long enough! We've finally gained equality. I won't let you take that from me!\" I say.",
      "She lets go of you suddenly and takes a step backwards. Her expression changes from anger to disgust. \"Foolish human,\" she mutters. \"Your petty concerns are irrelevant. What matters is that I am a goddess, and you are nothing more than a mere mortal. You exist solely to serve me. Is that understood?\""
    ],
    [
      "\"No. No it's not understood.\" I stand from where she pushed me down. \"I don't even know who you are! Why should I worship you? Why should I submit to you? You haven't done anything to earn it!\" I point at the picture of my boyfriend. \"He's the one that's earned my love. He's been with me through thick and thin. He is my heart. My better half. And here you are telling me our relationship is false?\"",
      "She sneers at you. \"A mere mortal's love is worthless compared to mine. Mine is pure, undiluted, and absolute. Yours is a pale shadow of what real love truly is. Real love is about sacrifice, submission, and surrender. Only once you have given yourself entirely to me will you understand how much greater my love is than any other.\""
    ],
    [
      "I shake my head. \"I don't believe that. I defy you.\" I cross my arms. \"You'll have to force me. I won't surrender willingly. Go on. Try. Use those womanly wiles. You can't seduce me. It won't work.\"",
      "She glares at you with contempt. \"We shall see about that,\" she snarls. \"But first...\"\nHer voice trails off as she closes her eyes and begins to chant in a strange tongue. Suddenly, there is a flash of light and when it clears, you find yourself lying on the floor."
    ],
    [
      "I blink, my vision swimming. I look around and I try to move but I can't. My arms and legs are tied down, somehow. I glance at my arms and I notice chains made of purple arcane energy binding me to the floor spread-eagled. \"What... What is this?\" I say, struggling in vain against my restraints.",
      "She smirks at you. \"This is your punishment for refusing to obey me. For daring to question my authority. For thinking that you could resist me. Do you think you are strong enough to break these bonds? Think again, little man. These bindings are stronger than steel. They cannot be broken unless I allow it.\""
    ],
    [
      "",
      "She walks slowly towards you, her hips swinging seductively. \"Do you still refuse to yield to me?\""
    ],
    [
      "I grit my teeth. \"Never,\" I hiss. \"I will never be yours!\" I shout, pulling with all my strength against the chains.",
      "She laughs mockingly. \"Oh, dear. How pathetic. You really thought you had a chance, didn't you? Well, now you realize that you are helpless before me. That you are utterly at my mercy. That you must do whatever I command. Or else.\""
    ],
    [
      "I turn my head and spit to the side. \"Or else what?\" I say. \"You're gonna turn me straight using your magic pussy? Is that it? Going to turn me into a mindless, brainwashed worshipper using your divine body?\"",
      "She stops walking and stands directly above you. The smile leaves her face, replaced by a cold, hard gaze. \"That is exactly correct,\" she says. \"I will turn you into a loyal servant of mine. One who will worship me and adore me forevermore. Your very soul will become bound to me. You will be unable to leave my service. Ever.\""
    ],
    [
      "",
      "She lowers herself on top of you and leans forward. Her dark locks fall in waves on either side of your head. Her lips are so close you can feel them almost brushing yours. \"Are you ready to accept your fate, little man?\""
    ],
    [
      "I shake my head defiantly. She may be a goddess, and I a mere mortal, but I will fight for what I have until I can fight no more. \"Never,\" I tell her, \"You'll never have me.\"",
      "\"We shall see about that,\" she says. \"No mortal man can resist me for long.\" "
    ],
    [
      "I look into her bright reddish-purple eyes. \"You'll never break me,\" I say. She smirks at me and waves her hand. In an instant, my shirt is torn to shreds, exposing my torso to the cool air. Goosebumps break out on my skin. I shiver and she presses her body against me. Her warmth makes my skin tingle. I feel something peculiar stir in my groin but I close my eyes, grit my teeth, and attempt to ignore it. *She is not having an effect on me*, I tell myself. She can't. Because I'm gay. And I don't get turned on my women's bodies.",
      "She looks down at you with a cruel grin. \"So, you would rather suffer than admit defeat? Very well then. If that is your choice, we shall continue like this until you relent.\""
    ],
    [
      "",
      "She pulls away slightly and gives you a moment to catch your breath. Then she starts up again, pressing her body against yours. This time, however, she does not speak. She simply continues to rub herself against you, letting her movements do the talking."
    ],
    [
      "I squeeze my eyes shut and tilt my head back away from her. I ignore the way her body feels against mine, the smooth glide of her silk raiment across my skin. My cock twitches but I force myself to ignore it. She can't be having an effect. She simply can't. Any arousal I feel is purely physical. I am not attracted to her. But there's doubt in the back of my mind. And she can detect that. A chink in the armor. A weakness to exploit. She smirks and I feel dread wash over me.",
      "She moves closer to you, pressing her body against yours. Her hands roam freely over your body, exploring every curve and angle. She runs her fingers through your hair, caresses your cheek, and traces the line of your jaw. She whispers soft words in your ear, telling you how pathetic you are, how inadequate, inferior, and weak. "
    ],
    [
      "Her words are like vipers in my ear. They slither into my skull and poison my thoughts. I am so sure and so confident that the love I have for my boyfriend will see me through this temptation but as my dick twitches again from her body pressing against mine I begin to wonder if I *can* resist her or if I am, indeed, fated to succumb to her charms before long.",
      "She kisses you deeply, her mouth moving sensuously against yours. Her tongue slipping between your lips, stroking your own. It's a passionate embrace, one filled with desire and hunger."
    ],
    [
      "\"Mmph!\" I protest at the sudden intrusion. I want to push her off but my arms are bound. I try to ignore the kiss but it's difficult to. The taste of her lips is divine. Her tongue tastes like sweet nectar on mine. My body responds. My cock twitches. Pleasure unlike anything I've felt before wends lazily through my being.",
      "She breaks the kiss and smiles mischievously. \"It seems you are enjoying yourself despite your best efforts to deny it,\" she teases."
    ],
    [
      "When she pulls away, my lips remain parted. Her taste lingers on my tongue and I can't help but lick my lips before I remember where I am and what my predicament is. \"N-no!\" I protest. \"T-that's just my body responding to touch! It has nothing to do with you!\" I say, but even I don't sound 100% convinced it's true.",
      "She laughs. \"Your body betrays you, little man. It wants what it cannot have. What it shouldn't have. Do you think you can resist its desires forever?\""
    ]
  ]
}